## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

### Структура и наполнение таблицы:

Таблица **trip**, в которой представлена информация о командировках сотрудников некоторой организации (фамилия сотрудника, город, куда он ездил, размер суточных, даты первого и последнего дня командировки):

In [5]:
%%sql
CREATE TABLE trip
(
    trip_id    INT PRIMARY KEY AUTO_INCREMENT,
    name       VARCHAR(30),
    city       VARCHAR(25),
    per_diem   DECIMAL(8, 2),
    date_first DATE,
    date_last  DATE
);

INSERT INTO trip
VALUES ("1", "Баранов П.Е.", "Москва", "700", "2020-01-12", "2020-01-17"),
       ("2", "Абрамова К.А.", "Владивосток", "450", "2020-01-14", "2020-01-27"),
       ("3", "Семенов И.В.", "Москва", "700", "2020-01-23", "2020-01-31"),
       ("4", "Ильиных Г.Р.", "Владивосток", "450", "2020-01-12", "2020-02-02"),
       ("5", "Колесов С.П.", "Москва", "700", "2020-02-01", "2020-02-06"),
       ("6", "Баранов П.Е.", "Москва", "700", "2020-02-14", "2020-02-22"),
       ("7", "Абрамова К.А.", "Москва", "700", "2020-02-23", "2020-03-01"),
       ("8", "Лебедев Т.К.", "Москва", "700", "2020-03-03", "2020-03-06"),
       ("9", "Колесов С.П.", "Новосибирск", "450", "2020-02-27", "2020-03-12"),
       ("10", "Семенов И.В.", "Санкт-Петербург", "700", "2020-03-29", "2020-04-05"),
       ("11", "Абрамова К.А.", "Москва", "700", "2020-04-06", "2020-04-14"),
       ("12", "Баранов П.Е.", "Новосибирск", "450", "2020-04-18", "2020-05-04"),
       ("13", "Лебедев Т.К.", "Томск", "450", "2020-05-20", "2020-05-31"),
       ("14", "Семенов И.В.", "Санкт-Петербург", "700", "2020-06-01", "2020-06-03"),
       ("15", "Абрамова К.А.", "Санкт-Петербург", "700", "2020-05-28", "2020-06-04"),
       ("16", "Федорова А.Ю.", "Новосибирск", "450", "2020-05-25", "2020-06-04"),
       ("17", "Колесов С.П.", "Новосибирск", "450", "2020-06-03", "2020-06-12"),
       ("18", "Федорова А.Ю.", "Томск", "450", "2020-06-20", "2020-06-26"),
       ("19", "Абрамова К.А.", "Владивосток", "450", "2020-07-02", "2020-07-13"),
       ("20", "Баранов П.Е.", "Воронеж", "450", "2020-07-19", "2020-07-25");

SELECT * FROM trip;

 * mysql://root:***@localhost/mydb
0 rows affected.
20 rows affected.
20 rows affected.

[(1, 'Баранов П.Е.', 'Москва', Decimal('700.00'), datetime.date(2020, 1, 12), datetime.date(2020, 1, 17)),
 (2, 'Абрамова К.А.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 1, 14), datetime.date(2020, 1, 27)),
 (3, 'Семенов И.В.', 'Москва', Decimal('700.00'), datetime.date(2020, 1, 23), datetime.date(2020, 1, 31)),
 (4, 'Ильиных Г.Р.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 1, 12), datetime.date(2020, 2, 2)),
 (5, 'Колесов С.П.', 'Москва', Decimal('700.00'), datetime.date(2020, 2, 1), datetime.date(2020, 2, 6)),
 (6, 'Баранов П.Е.', 'Москва', Decimal('700.00'), datetime.date(2020, 2, 14), datetime.date(2020, 2, 22)),
 (7, 'Абрамова К.А.', 'Москва', Decimal('700.00'), datetime.date(2020, 2, 23), datetime.date(2020, 3, 1)),
 (8, 'Лебедев Т.К.', 'Москва', Decimal('700.00'), datetime.date(2020, 3, 3), datetime.date(2020, 3, 6)),
 (9, 'Колесов С.П.', 'Новосибирск', Decimal('450.00'), datetime.date(2020, 2, 27), datetime.date(2020, 3, 12)),
 (10, 'Семенов И.В.', 'Санкт-Петербург', Decimal('700.00'), datetime.date(2020, 3, 29), datetime.date(2020, 4, 5)),
 (11, 'Абрамова К.А.', 'Москва', Decimal('700.00'), datetime.date(2020, 4, 6), datetime.date(2020, 4, 14)),
 (12, 'Баранов П.Е.', 'Новосибирск', Decimal('450.00'), datetime.date(2020, 4, 18), datetime.date(2020, 5, 4)),
 (13, 'Лебедев Т.К.', 'Томск', Decimal('450.00'), datetime.date(2020, 5, 20), datetime.date(2020, 5, 31)),
 (14, 'Семенов И.В.', 'Санкт-Петербург', Decimal('700.00'), datetime.date(2020, 6, 1), datetime.date(2020, 6, 3)),
 (15, 'Абрамова К.А.', 'Санкт-Петербург', Decimal('700.00'), datetime.date(2020, 5, 28), datetime.date(2020, 6, 4)),
 (16, 'Федорова А.Ю.', 'Новосибирск', Decimal('450.00'), datetime.date(2020, 5, 25), datetime.date(2020, 6, 4)),
 (17, 'Колесов С.П.', 'Новосибирск', Decimal('450.00'), datetime.date(2020, 6, 3), datetime.date(2020, 6, 12)),
 (18, 'Федорова А.Ю.', 'Томск', Decimal('450.00'), datetime.date(2020, 6, 20), datetime.date(2020, 6, 26)),
 (19, 'Абрамова К.А.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 7, 2), datetime.date(2020, 7, 13)),
 (20, 'Баранов П.Е.', 'Воронеж', Decimal('450.00'), datetime.date(2020, 7, 19), datetime.date(2020, 7, 25))]

## 1.6.2 Задание

Вывести из таблицы **trip** информацию о командировках тех сотрудников, фамилия которых заканчивается на букву «а», в отсортированном по убыванию даты последнего дня командировки виде. В результат включить столбцы **name, city, per_diem, date_first, date_last**.

In [6]:
%%sql
SELECT
    name,
    city,
    per_diem,
    date_first,
    date_last
FROM
    trip
WHERE
    name LIKE '%а %'
ORDER BY
    date_last DESC;

 * mysql://root:***@localhost/mydb
7 rows affected.

[('Абрамова К.А.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 7, 2), datetime.date(2020, 7, 13)),
 ('Федорова А.Ю.', 'Томск', Decimal('450.00'), datetime.date(2020, 6, 20), datetime.date(2020, 6, 26)),
 ('Абрамова К.А.', 'Санкт-Петербург', Decimal('700.00'), datetime.date(2020, 5, 28), datetime.date(2020, 6, 4)),
 ('Федорова А.Ю.', 'Новосибирск', Decimal('450.00'), datetime.date(2020, 5, 25), datetime.date(2020, 6, 4)),
 ('Абрамова К.А.', 'Москва', Decimal('700.00'), datetime.date(2020, 4, 6), datetime.date(2020, 4, 14)),
 ('Абрамова К.А.', 'Москва', Decimal('700.00'), datetime.date(2020, 2, 23), datetime.date(2020, 3, 1)),
 ('Абрамова К.А.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 1, 14), datetime.date(2020, 1, 27))]

## 1.6.3 Задание

Вывести в алфавитном порядке фамилии и инициалы тех сотрудников, которые были в командировке в Москве.

In [8]:
%%sql
SELECT DISTINCT
    name
FROM
    trip
WHERE
    city = 'Москва'
ORDER BY
    name ASC;

 * mysql://root:***@localhost/mydb
5 rows affected.

[('Абрамова К.А.',),
 ('Баранов П.Е.',),
 ('Колесов С.П.',),
 ('Лебедев Т.К.',),
 ('Семенов И.В.',)]

## 1.6.4 Задание

Для каждого города посчитать, сколько раз сотрудники в нем были.  Информацию вывести в отсортированном в алфавитном порядке по названию городов. Вычисляемый столбец назвать **Количество**.

In [10]:
%%sql
SELECT
    city,
    count(trip_id) AS  Количество
FROM
    trip
GROUP BY
    city
ORDER BY
    city ASC;

 * mysql://root:***@localhost/mydb
6 rows affected.

[('Владивосток', 3),
 ('Воронеж', 1),
 ('Москва', 7),
 ('Новосибирск', 4),
 ('Санкт-Петербург', 3),
 ('Томск', 2)]

## 1.6.5 Оператор LIMIT

Вывести два города, в которых чаще всего были в командировках сотрудники. Вычисляемый столбец назвать **Количество**.

In [11]:
%%sql
SELECT
    city,
    count(trip_id) AS Количество
FROM
    trip
GROUP BY
    city
ORDER BY
    Количество DESC
LIMIT 2;

 * mysql://root:***@localhost/mydb
2 rows affected.

[('Москва', 7), ('Новосибирск', 4)]

## 1.6.6 Задание

Вывести информацию о командировках во все города кроме Москвы и Санкт-Петербурга (фамилии и инициалы сотрудников, город,  длительность командировки в днях, при этом первый и последний день относится к периоду командировки). Последний столбец назвать **Длительность**. Информацию вывести в упорядоченном по убыванию длительности поездки, а потом по убыванию названий городов (в обратном алфавитном порядке).

In [12]:
%%sql
SELECT
    name,
    city,
    DATEDIFF(date_last, date_first) + 1 AS Длительность
FROM
    trip
WHERE
    city NOT IN ('Москва',  'Санкт-Петербург')
ORDER BY
    Длительность DESC,
    city DESC;

 * mysql://root:***@localhost/mydb
10 rows affected.

[('Ильиных Г.Р.', 'Владивосток', 22),
 ('Баранов П.Е.', 'Новосибирск', 17),
 ('Колесов С.П.', 'Новосибирск', 15),
 ('Абрамова К.А.', 'Владивосток', 14),
 ('Лебедев Т.К.', 'Томск', 12),
 ('Абрамова К.А.', 'Владивосток', 12),
 ('Федорова А.Ю.', 'Новосибирск', 11),
 ('Колесов С.П.', 'Новосибирск', 10),
 ('Федорова А.Ю.', 'Томск', 7),
 ('Баранов П.Е.', 'Воронеж', 7)]

## 1.6.7 Задание

Вывести информацию о командировках сотрудника(ов), которые были самыми короткими по времени. В результат включить столбцы **name, city, date_first, date_last**.

In [13]:
%%sql
SELECT
    name,
    city,
    date_first,
    date_last
FROM
    trip
WHERE
    DATEDIFF(date_last, date_first) = (
        SELECT MIN(DATEDIFF(date_last, date_first))
        FROM trip
    );

 * mysql://root:***@localhost/mydb
1 rows affected.

[('Семенов И.В.', 'Санкт-Петербург', datetime.date(2020, 6, 1), datetime.date(2020, 6, 3))]

## 1.6.8 Задание

Вывести информацию о командировках, начало и конец которых относятся к одному месяцу (год может быть любой). В результат включить столбцы **name, city, date_first, date_last**. Строки отсортировать сначала  в алфавитном порядке по названию города, а затем по фамилии сотрудника .

In [14]:
%%sql
SELECT
    name,
    city,
    date_first,
    date_last
FROM
    trip
WHERE
    MONTH(date_first) = MONTH(date_last)
ORDER BY
    city,
    name;

 * mysql://root:***@localhost/mydb
13 rows affected.

[('Абрамова К.А.', 'Владивосток', datetime.date(2020, 1, 14), datetime.date(2020, 1, 27)),
 ('Абрамова К.А.', 'Владивосток', datetime.date(2020, 7, 2), datetime.date(2020, 7, 13)),
 ('Баранов П.Е.', 'Воронеж', datetime.date(2020, 7, 19), datetime.date(2020, 7, 25)),
 ('Абрамова К.А.', 'Москва', datetime.date(2020, 4, 6), datetime.date(2020, 4, 14)),
 ('Баранов П.Е.', 'Москва', datetime.date(2020, 1, 12), datetime.date(2020, 1, 17)),
 ('Баранов П.Е.', 'Москва', datetime.date(2020, 2, 14), datetime.date(2020, 2, 22)),
 ('Колесов С.П.', 'Москва', datetime.date(2020, 2, 1), datetime.date(2020, 2, 6)),
 ('Лебедев Т.К.', 'Москва', datetime.date(2020, 3, 3), datetime.date(2020, 3, 6)),
 ('Семенов И.В.', 'Москва', datetime.date(2020, 1, 23), datetime.date(2020, 1, 31)),
 ('Колесов С.П.', 'Новосибирск', datetime.date(2020, 6, 3), datetime.date(2020, 6, 12)),
 ('Семенов И.В.', 'Санкт-Петербург', datetime.date(2020, 6, 1), datetime.date(2020, 6, 3)),
 ('Лебедев Т.К.', 'Томск', datetime.date(2020, 5, 20), datetime.date(2020, 5, 31)),
 ('Федорова А.Ю.', 'Томск', datetime.date(2020, 6, 20), datetime.date(2020, 6, 26))]

## 1.6.9 Задание

Вывести название месяца и количество командировок для каждого месяца. Считаем, что командировка относится к некоторому месяцу, если она началась в этом месяце. Информацию вывести сначала в отсортированном по убыванию количества, а потом в алфавитном порядке по названию месяца виде. Название столбцов – **Месяц** и **Количество**.

In [15]:
%%sql
SELECT
    MONTHNAME(date_first) AS Месяц,
    count(trip_id) AS Количество
FROM
    trip
GROUP BY
    MONTHNAME(date_first)
ORDER BY
    Количество DESC,
    Месяц ASC;

 * mysql://root:***@localhost/mydb
7 rows affected.

[('February', 4),
 ('January', 4),
 ('June', 3),
 ('May', 3),
 ('April', 2),
 ('July', 2),
 ('March', 2)]

## 1.6.10 Задание

Вывести сумму суточных (произведение количества дней командировки и размера суточных) для командировок, первый день которых пришелся на февраль или март 2020 года. Значение суточных для каждой командировки занесено в столбец **per_diem**. Вывести фамилию и инициалы сотрудника, город, первый день командировки и сумму суточных. Последний столбец назвать **Сумма**. Информацию отсортировать сначала  в алфавитном порядке по фамилиям сотрудников, а затем по убыванию суммы суточных.

In [17]:
%%sql
SELECT
    name,
    city,
    date_first,
    (DATEDIFF(date_last, date_first) + 1) * per_diem AS Сумма
FROM
    trip
WHERE
    MONTH(date_first) IN (2, 3) AND
    YEAR(date_first) = 2020
ORDER BY
    name,
    Сумма DESC;

 * mysql://root:***@localhost/mydb
6 rows affected.

[('Абрамова К.А.', 'Москва', datetime.date(2020, 2, 23), Decimal('5600.00')),
 ('Баранов П.Е.', 'Москва', datetime.date(2020, 2, 14), Decimal('6300.00')),
 ('Колесов С.П.', 'Новосибирск', datetime.date(2020, 2, 27), Decimal('6750.00')),
 ('Колесов С.П.', 'Москва', datetime.date(2020, 2, 1), Decimal('4200.00')),
 ('Лебедев Т.К.', 'Москва', datetime.date(2020, 3, 3), Decimal('2800.00')),
 ('Семенов И.В.', 'Санкт-Петербург', datetime.date(2020, 3, 29), Decimal('5600.00'))]

**Еще способ выборки:** WHERE date_first BETWEEN '2020-02-01' AND '2020-03-31'

## 1.6.11 Задание

Только для этого задания изменена строка таблицы **trip**:

In [18]:
%%sql
UPDATE trip
SET date_last = '2020-03-02'
WHERE trip_id = 4;

SELECT * FROM trip WHERE trip_id = 4;

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.

[(4, 'Ильиных Г.Р.', 'Владивосток', Decimal('450.00'), datetime.date(2020, 1, 12), datetime.date(2020, 3, 2))]

Вывести фамилию с инициалами и общую сумму суточных, полученных за все командировки для тех сотрудников, которые были в командировках больше чем 3 раза, в отсортированном по убыванию сумм суточных виде. Последний столбец назвать **Сумма**.

In [20]:
%%sql
SELECT
    name,
    SUM((DATEDIFF(date_last, date_first) + 1) * per_diem) AS Сумма
FROM
    trip
GROUP BY
    name
HAVING
    count(name) > 3
ORDER BY
    Сумма DESC;

 * mysql://root:***@localhost/mydb
2 rows affected.

[('Абрамова К.А.', Decimal('29200.00')), ('Баранов П.Е.', Decimal('21300.00'))]